Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མདུན་དུ་བཤད་ཅིང་བསྟན་ཏོ།
en: They should, however, be explained and revealed in the presence of bodhisattva great beings who are irreversible.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་དང་། སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱེད་བྱེད་པའི་མདུན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟར་བསྟན་པ་འདི་བཤད་པར་བྱའོ། །བསྟན་པར་བྱའོ།
en: This perfection of wisdom should be explained and it should be taught, just as it has been revealed, in the presence of those who have been accepted by spiritual mentors, those who have performed deeds of service on behalf of the conquerors, those who have generated the roots of virtuous action and venerated many buddhas.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟར་བསྟན་པ་བཤད་པར་བྱའོ།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity should be explained and taught, just as they have been revealed.

source: །བསྟན་པར་བྱའོ། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་དེ་ལྟར་བསྟན་པ་བཤད་པར་བྱའོ། །བསྟན་པར་བྱའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: The emptiness of internal phenomena and the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, should be explained and taught, just as they have been revealed.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དེ་ལྟར་བསྟན་པ་བཤད་པར་བྱའོ།
en: The applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas should be explained and taught, just as they have been revealed.

source: །བསྟན་པར་བྱའོ། །ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ལྟར་བསྟན་པར་བཤད་པར་བྱའོ།
en: Knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience should be explained and taught, just as they have been revealed.

source: །བསྟན་པར་བྱའོ། །དེའི་མདུན་དུ་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་རྣམས་བཤད་པར་བྱའོ། །བསྟན་པར་བྱའོ།
en: In their presence the attributes that are empty of their own defining characteristics should be explained and taught.

source: །དེས་ནི་དེ་ཐོས་ན་མི་འཇིགས་མི་དངང་སྐྲག་པར་མྱི་འགྱུར་ཏེ།
en: When they hear this, they will not be afraid, they will not be frightened, and they will not be terrified.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །རབ་འབྱོར་གྱིས་སྨྲས་པ། བྱམས་པ་སེམས་གང་གིས་རྗེས་སུ་ཡི་རང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱ་བའི་སེམས་དེ་ནི་ཟད་ཅིང་འགགས་ལ་མེད་དེ་རྣམ་པར་གྱུར་ལ། དངོས་པོ་དེ་དག་དང་། དམིགས་པ་དེ་དག་དང་།
en: It is in that manner, Subhūti, that bodhisattva great beings should dedicate the foundations of meritorious action, endowed with rejoicing, to unsurpassed, complete enlightenment.” “

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཟད་ཅིང་འགགས་ལ་མེད་དེ་རྣམ་པར་གྱུར་ན། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་དེ་ནི་གང་ཞིག །དངོས་པོ་དེ་དག་ནི་གང་ཞིག །དམིགས་པ་དེ་དག་ནི་གང་ཞིག །དགེ་བའི་རྩ་བ་དེ་དག་ནི་གང་ཞིག །
en: Maitreya,” replied Subhūti, “if the thoughts by which they rejoice and dedicate the roots of virtuous action to unsurpassed, complete enlightenment are extinct, defunct, and nonexistent, and if these foundations of meritorious action, these objective referents, and these roots of virtuous action are also extinct, defunct, and nonexistent, what is that mind that rejoices, what are those foundations of meritorious action, what are those objective referents, and what are those roots of virtuous action that should be dedicated to unsurpassed, complete enlightenment?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱ། ཅི་སེམས་ཀྱིས་སེམས་ཡོངས་སུ་བསྔོའམ།
en: How can the mind dedicate the mind?

source: དེ་ལྟར་སེམས་ཀྱིས་སེམས་ཡོངས་སུ་བསྔོ་ན་ནི། སེམས་གཉིས་འཕྲད་པར་འགྱུར་བ་མེད་དེ།
en: If the mind were to dedicate the mind in that manner, there would be two minds that would not meet!

source: སེམས་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ཡང་ཡོངས་སུ་བསྔོ་བར་མི་ནུས་སོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དངོས་པོ་མེད་པའོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དངོས་པོ་མེད་པའོ། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་དངོས་པོ་མེད་པའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་དངོས་པོ་མེད་པའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ནི་དངོས་པོ་མེད་པའོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: The intrinsic nature of mind cannot be dedicated. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་དངོས་པོ་མེད་པའོ། །རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དངོས་པོ་མེད་པའོ་ཞེས་བྱ་བར་ཤེས་ན། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: When bodhisattva great beings practice the perfection of wisdom, if they know that the perfection of wisdom is a nonentity; that the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are nonentities; that the emptiness of internal phenomena and the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonentities; that the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are nonentities; that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are nonentities; that the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas are nonentities; and that the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience are all nonentities, they should then dedicate the foundation of their meritorious action, endowed with rejoicing, to unsurpassed, complete enlightenment.

source: །གལ་ཏེ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པར་འགྱུར་རོ།
en: If they make the dedication in this manner, they will make the dedication to unsurpassed, complete enlightenment.”

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། གནས་བརྟན་རབ་འབྱོར་ལ་སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསྟན་པ་འདི་ཐོས་ན། འཇིགས་ཤིང་སྡང་བའམ། སྐྲག་པར་མི་འགྱུར་རམ།
en: Then Śakra, mighty lord of the gods, said to the elder Subhūti, “Blessed Subhūti, if bodhisattva great beings who have newly entered into the vehicle were to hear this teaching, they would be afraid, frightened, and terrified.

source: བཙུན་པ་རབ་འབྱོར་ཇི་ལྟར་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱ།
en: Blessed Subhūti, how should bodhisattva great beings who have newly entered into the vehicle dedicate these roots of virtuous action to unsurpassed, complete enlightenment?

source: ཇི་ལྟར་ན་དེས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཡོངས་སུ་བཟུང་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་མ་ཡིན། དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: How do they, having acquired the foundation of meritorious action endowed with rejoicing, not dedicate it to unsurpassed, complete enlightenment?”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་དམིགས་ནས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་གལ་ཏེ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་འཛིན་པར་བྱེད། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་འཛིན་པར་བྱེད། ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་ཅིང་། ནང་སྟོང་པ་ཉིད་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་འཛིན་པར་བྱེད། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ཅིང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་འཛིན་པར་བྱེད། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་ཅིང་། དྲན་པ་ཉེ་བར་གཞག་པ་དེ་དག་ཀྱང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས། འཛིན་པར་བྱེད། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་ཅིང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་འཛིན་པར་བྱེད། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: Then the venerable Subhūti, with reference to the bodhisattva great being Maitreya, replied to Śakra, mighty lord of the gods, “Kauśika, if those bodhisattva great beings who have newly entered into the vehicle practice the perfection of wisdom and grasp this perfection of wisdom, without apprehending anything and by way of signlessness; if they practice the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, {Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་ཅིང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་པོ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་འཛིན་པར་བྱེད།
en: II-III: 127} and the perfection of generosity, and grasp this perfection of generosity [and so forth], without apprehending anything and by way of signlessness; if they practice the emptiness of internal phenomena and grasp this emptiness of internal phenomena, without apprehending anything and by way of signlessness; if they practice the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and grasp this emptiness of the essential nature of nonentities, without apprehending anything and by way of signlessness; if they practice the applications of mindfulness and grasp these applications of mindfulness, without apprehending anything and by way of signlessness; if they practice the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, and grasp this noble eightfold path [and so forth], without apprehending anything and by way of signlessness; if they practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas, and grasp these eighteen distinct qualities of the buddhas [and so forth], without apprehending anything and by way of signlessness; if they practice knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience, and grasp all-aspect omniscience [and so forth], without apprehending anything and by way of signlessness, then they will have much devotion for the perfection of wisdom; they will have much devotion for the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity; they will have much devotion for the emptiness of internal phenomena; they will have much devotion for the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; they will have much devotion for the thirty-seven factors conducive to enlightenment; they will have much devotion for the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; they will have much devotion for the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness; they will have much devotion for the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas; and they will have much devotion for knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience. “

source: ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་སྤྱོད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དང་། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་འཛིན་པར་བྱེད་ན། དེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མོས་པ་མང་བ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མོས་པ་མང་བ་དང་། ནང་སྟོང་པ་ཉིད་ལ་མོས་པ་མང་བ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མོས་པ་མང་བ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་མོས་པ་མང་བ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་མོས་པ་མང་བ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་མོས་པ་མང་བ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་མོས་པ་མང་བ་དང་། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མོས་པ་མང་བར་འགྱུར་རོ། །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པར་འགྱུར་རོ། །དགེ་བའི་བཤེས་གཉེན་དེ་དག་ཀྱང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་དོན་དང་ལྡན་ཡི་གེ་དང་ལྡན་པར་སྟོན་པར་འགྱུར་ཏེ།
en: They will be favored by spiritual mentors, and those spiritual mentors will also reveal to them the six perfections in accordance with their meaning and letters.

source: དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཆུད་ཀྱི་བར་དུ། ཅི་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མི་འགྱུར་བ་དེ་ལྟར་སྟོན་ཏོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: They will teach them in such a way that they will not be separated in any way from the perfection of wisdom, until they have entered upon the maturity of the bodhisattvas.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་བར་མི་འགྱུར་བ་དེ་ལྟར་སྟོན་ཏོ། །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: They will teach them in such a way that they will not be separated from the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: They will teach them in such a way that they will not be separated from all the aspects of emptiness.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་བྲལ་བར་མི་འགྱུར་བ་དེ་ལྟར་སྟོན་ཏོ།
en: They will teach them in such a way that they will not be separated from the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the five extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas. “

source: །དེ་ལ་བདུད་ཀྱི་ལས་རྣམས་ཀྱང་སྟོན་པར་འགྱུར་རོ། །དེས་བདུད་ཀྱི་ལས་དེ་དག་ཐོས་ནས་འགྲིབ་པའམ། འཕེལ་བ་མེད་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བདུད་ཀྱི་ལས་དེ་དག་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: They will also teach them about the deeds of Māra, and, once they have heard about those deeds of Māra, how those deeds are without decline or increase; if you ask why, it is because those deeds of Māra are without inherent existence.

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཆུད་ཀྱི་བར་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་བྲལ་བར་མི་འགྱུར་ཏེ།
en: Until they enter a bodhisattva’s full maturity they will not be separated from the lord buddhas.

source: དེ་དག་ལ་ཡང་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རིགས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: They will also generate the roots of virtuous action, and by these roots of virtuous action they will indeed secure the spiritual family of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་རིགས་དེ་དག་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་བྲལ་བར་མི་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི། ཤར་ཕྱོགས་དང་། ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་།
en: Until they attain consummate buddhahood in unsurpassed, complete enlightenment, they will never be separated from the spiritual family of the bodhisattvas. “

source: ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཚད་མེད་པ་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚད་མེད་གྲངས་མེད་པ་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྤྲོས་པའི་ཚུལ་ཆད་པར་གྱུར་པ། ཚིག་གི་ལམ་ཉམས་པ་མི་མངའ་བ། ཁུར་བོར་བ། གྲོང་གི་ཚེར་མ་རབ་ཏུ་བསལ་བ། སྲིད་པ་ཀུན་དུ་སྦྱོར་བ་ཡོངས་སུ་ཆད་པ། ཡང་དག་པར་ཡོངས་སུ་མཁྱེན་པས།
en: Moreover, Kauśika, bodhisattva great beings who have newly entered into the vehicle should gather, assimilate, and evaluate all the merits accrued by immeasurable, countless tathāgatas, arhats, completely awakened buddhas who are alive at present in the countless, immeasurable world systems in each of the directions—eastern, southern, western, northern, northeastern, southeastern, southwestern, and northwestern, along with the nadir and the zenith—and by the lord buddhas along with their saṅghas of śrāvakas who teach the Dharma, and by those whose modes of conceptual elaboration have been cut off, whose verbal pathways are unimpaired, whose burden has been relinquished, whose pangs of death have been eliminated, whose fetters of rebirth have been cut off, and whose minds have been absolutely liberated by genuine understanding. [

source: ཐུགས་ཤིན་དུ་རྣམ་པར་གྲོལ་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་དག་གིས་བསོད་ནམས་མངོན་པར་འདུ་མཛད་པ་དང་། དེ་དག་དུ་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའམ། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བའམ།
en: They should gather, assimilate, and evaluate] all the roots of virtue, as many as have been generated by those of great and lofty royal families, {Ki.

source: ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་འམ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་འམ། སུམ་ཅུ་རྩ་གསུམ་འམ། མཚེ་མ་འམ། དགའ་ལྡན་ནམ་འཕྲུལ་དགའ་འམ། གཞན་འཕྲུལ་དབང་བྱེད་དམ། ཚངས་རིས་སམ། ཚངས་ལྷ་ཉེ་ཕན་ནམ། ཚངས་པ་ཀུན་འཁོར་ཏམ། ཚངས་ཆེན་ནམ། སྣང་བའམ། ཆུང་སྣང་ངམ། ཚད་མེད་སྣང་བའམ། ཀུན་སྣང་དང་བའམ། དགེ་བའམ། ཆུང་དགེ་འམ། ཚད་མེད་དགེ་བའམ། དགེ་རྒྱས་སམ། ཆེ་བའམ། ཆུང་ཆེ་འམ། ཚད་མེད་ཆེ་བའམ། འབྲས་བུ་ཆེ་བའམ། མི་ཆེ་བའམ། མི་གདུང་བའམ། ཤིན་ཏུ་མཐོང་བའམ། གྱ་ནོམ་སྣང་བའམ། འོག་མྱིན་གྱི་ལྷ་རྣམས་སམ། སུས་ཀྱང་རུང་སྟེ། དགེ་བའི་རྩ་བ་ཇི་སྙེད་ཅིག་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་མངོན་པར་བསྡུས་ཏེ་གཅིག་ཏུ་བརྟུལ་ནས་ཚད་བཟུང་སྟེ།
en: II-III: 128} by those of great and lofty priestly families, by those of great and lofty householder families, and by the gods of Caturmahā­rāja­kāyika, Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahma­pariṣadya, Brahmapurohita, Mahābrahmā Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana and Akaniṣṭha, or by anyone else.

source: རྗེས་སུ་ཡི་རང་བའི་རབ་དམ་པ། མཆོག་ཕུལ། གཙོ་བོ་གྱ་ནོམ་པ་བླ་ན་མེད་པ། གོང་ན་མེད་པ། མཉམ་པ་མེད་པ།
en: They should rejoice in these [virtuous actions] with the best, most authentic, supreme, perfect, foremost, most sublime, unsurpassed, and highest rejoicing that is unequaled and equal to the unequaled.

source: མི་མཉམ་པ་དང་མཉམ་པས་རྗེས་སུ་ཡི་རང་བར་བྱས་ཏེ། རྗེས་སུ་ཡི་རང་བར་བྱས་ནས་ཀྱང་། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: And having rejoiced, making common cause with all beings, they should dedicate those to unsurpassed, complete enlightenment.”
